holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Show keyboard
    lv_obj_move_foreground(kb->kb);
    lv_obj_move_foreground(kb->ta);
    lv_obj_clear_flag(kb->kb, LV_OBJ_FLAG_HIDDEN);
    lv_obj_clear_flag(kb->ta, LV_OBJ_FLAG_HIDDEN);
}

/** ---------------------------------------------------------------------------------------
 * @brief Event callback for keyboard events.
 * 
 * Intended to be used across multiple keyboards by linking the relevant object to a
 * related keyboard via user data.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void keyboard_event_cb(lv_event_t * e)
{
    // Get event code
    lv_event_code_t code = lv_event_get_code(e);
    if(code != LV_EVENT_VALUE_CHANGED) {
        return;
    }

    // Get event target
    lv_obj_t * kb_target = (lv_obj_t *)lv_event_get_target(e);
    keyboard_t * kb_user_data = (keyboard_t *)lv_event_get_user_data(e);

    // Ensure the event is from an expected keyboard
    if(kb_target != kb_user_data->kb) {
        return;
    }

    // Get the text of the selected object
    uint32_t obj_id = lv_keyboard_get_selected_btn(kb_user_data->kb);
    const char * obj_text = lv_keyboard_get_btn_text(kb_user_data->kb, obj_id);

    // Only proceed if "OK", "Enter", or the LV_SYMBOL_OK button was pressed
    if(strcmp(obj_text, LV_SYMBOL_OK) != 0 &&
       strcmp(obj_text, "Enter") != 0 &&
       strcmp(obj_text, "OK") != 0) {return;}

    // Get the designated textarea that triggered this keyboard
    lv_obj_t * designated_ta = (lv_obj_t *)lv_obj_get_user_data(kb_user_data->ta);
    if(!designated_ta) {
        return;
    }

    // Get context from designated textarea
    kb_ctx_t * ctx = (kb_ctx_t *)lv_obj_get_user_data(designated_ta);

    // Get the input text from the keyboard's textarea
    const char * input = lv_textarea_get_text(kb_user_data->ta);

    // Route to correct destination using context
    switch (ctx ? ctx->target : KB_TARGET_NONE) {

        case KB_MATRIX_VALUE_X:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
            }
            break;

        case KB_MATRIX_VALUE_Y:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
            }
            break;
        
        case KB_MATRIX_VALUE_Z:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
            }
            break;
        
        case KB_MATRIX_OUTPUT_PWM_0:
            if (strval_validate(ctx->strval_type, input)) {
                uint32_t val = strtoul(input, NULL, 10);
                matrixData.output_pwm[0][current_matrix_i][INDEX_MATRIX_SWITCH_PWM_OFF] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
            }
            break;
        
        case KB_MATRIX_OUTPUT_PWM_1:
            if (strval_validate(ctx->strval_type, input)) {
                uint32_t val = strtoul(input, NULL, 10);
                matrixData.output_pwm[0][current_matrix_i][INDEX_MATRIX_SWITCH_PWM_ON] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
            }
            break;
        
        case KB_MATRIX_PORT_MAP:
            if (strval_validate(ctx->strval_type, input)) {
                int16_t val = atoi(input);
                matrixData.matrix_port_map[0][current_matrix_i] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
            }
            break;
        
        case KB_MAPPING_C1:
            if (strval_validate(ctx->strval_type, input)) {
                int32_t val = strtol(input, NULL, 10);
                mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C1] = val;
            }
            else {
            }
            break;
        
        case KB_MAPPING_C2:
            if (strval_validate(ctx->strval_type, input)) {
                int32_t val = strtol(input, NULL, 10);
                mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C2] = val;
            }
            else {
            }
            break;

        case KB_MAPPING_C3:
            if (strval_validate(ctx->strval_type, input)) {
                int32_t val = strtol(input, NULL, 10);
                mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C3] = val;
            }
            else {
            }
            break;

        case KB_MAPPING_C4:
            if (strval_validate(ctx->strval_type, input)) {
                int32_t val = strtol(input, NULL, 10);
                mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C4] = val;
            }
            else {
            }
            break;

        case KB_MAPPING_C5:
            if (strval_validate(ctx->strval_type, input)) {
                int32_t val = strtol(input, NULL, 10);
                mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C5] = val;
            }
            else {
            }
            break;

        case KB_USER_LATITUDE:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                satioData.user_degrees_latitude = val;
            }
            else {
            }
            break;

        case KB_USER_LONGITUDE:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                satioData.user_degrees_longitude = val;
            }
            else {
            }
            break;

        case KB_USER_ALTITUDE:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                satioData.user_altitude = val;
            }
            else {
            }
            break;

        case KB_USER_SPEED:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                satioData.user_speed= val;
            }
            else {
            }
            break;

        case KB_USER_GROUND_HEADING:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                satioData.user_ground_heading= val;
            }
            else {
            }
            break;

        case KB_UTC_OFFSET_SECONDS:
            if (strval_validate(ctx->strval_type, input)) {
                int64_t val = atoll(input);
                satioData.localTime.second_offset = val;
            }
            else {
            }
            break;
        
