holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    if(code == LV_EVENT_CLICKED) {
        satioData.altitude_value_mode = SATIO_MODE_GPS;
    }
}
/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_altitude_mode_user_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.altitude_value_mode = SATIO_MODE_USER;
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_speed_mode_gps_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.speed_value_mode = SATIO_MODE_GPS;
    }
}
/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_speed_mode_user_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.speed_value_mode = SATIO_MODE_USER;
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_ground_heading_mode_gps_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.ground_heading_value_mode = SATIO_MODE_GPS;
    }
}
/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_ground_heading_mode_user_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.ground_heading_value_mode = SATIO_MODE_USER;
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_auto_set_user_lat_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.user_degrees_latitude = satioData.degrees_latitude;
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_auto_set_user_lon_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.user_degrees_longitude = satioData.degrees_longitude;
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_auto_set_user_altitude_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.user_altitude = satioData.altitude;
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_auto_set_user_speed_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.user_speed = satioData.speed;
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_auto_set_user_ground_heading_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.user_ground_heading = satioData.ground_heading;
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void sw_output_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if (code == LV_EVENT_VALUE_CHANGED)
    {
        lv_obj_t * sw = (lv_obj_t *)lv_event_get_target(e);

        bool is_enabled = lv_obj_has_state(sw, LV_STATE_CHECKED);

        if (sw == serial_c.sw_output_all) {
            setAllSentenceOutput(is_enabled);
            }

        else if (sw == serial_c.sw_output_satio) {
            systemData.output_satio_enabled = is_enabled;
            }

        else if (sw == serial_c.sw_output_gngga) {
            systemData.output_gngga_enabled = is_enabled;
            }

        else if (sw == serial_c.sw_output_gnrmc) {
            systemData.output_gnrmc_enabled = is_enabled;
            }

        else if (sw == serial_c.sw_output_gpatt) {
            systemData.output_gpatt_enabled = is_enabled;
            }

        else if (sw == serial_c.sw_output_ins) {
            systemData.output_ins_enabled = is_enabled;
            }

        else if (sw == serial_c.sw_output_matrix) {
            systemData.output_matrix_enabled = is_enabled;
            }

        else if (sw == serial_c.sw_output_input_controller) {
            systemData.output_input_portcontroller = is_enabled;
            }

        else if (sw == serial_c.sw_output_admplex_0) {
            systemData.output_admplex0_enabled = is_enabled;
            }

        else if (sw == serial_c.sw_output_admplex_1) {
            systemData.output_admplex1_enabled = is_enabled;
            }

        else if (sw == serial_c.sw_output_gyro_0) {
            systemData.output_gyro_0_enabled = is_enabled;
            }

        else if (sw == serial_c.sw_output_sun) {
            systemData.output_sun_enabled = is_enabled;
            }

        else if (sw == serial_c.sw_output_mercury) {
            systemData.output_mercury_enabled = is_enabled;
            }

        else if (sw == serial_c.sw_output_venus) {
            systemData.output_venus_enabled = is_enabled;
            }

