holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_set_size(result.lbl_formatted_rtc_sync_time, obj_w_0, obj_height);
    lv_obj_set_size(result.val_formatted_rtc_sync_time, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Formatted RTC Sync Date                                */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_formatted_rtc_sync_date = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_formatted_rtc_sync_date = create_label(
        row_formatted_rtc_sync_date,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC Sync Date",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_formatted_rtc_sync_date = create_label(
        row_formatted_rtc_sync_date,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_formatted_rtc_sync_date, obj_w_0, obj_height);
    lv_obj_set_size(result.val_formatted_rtc_sync_date, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row RTC Sync Latitude                                      */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_rtc_sync_latitude = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_rtcsync_latitude = create_label(
        row_rtc_sync_latitude,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC Sync Lat",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_rtcsync_latitude = create_label(
        row_rtc_sync_latitude,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_rtcsync_latitude, obj_w_0, obj_height);
    lv_obj_set_size(result.val_rtcsync_latitude, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row RTC Sync Longitude                                     */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_rtc_sync_longitude = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_rtcsync_longitude = create_label(
        row_rtc_sync_longitude,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC Sync Lon",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_rtcsync_longitude = create_label(
        row_rtc_sync_longitude,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_rtcsync_longitude, obj_w_0, obj_height);
    lv_obj_set_size(result.val_rtcsync_longitude, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row RTC Sync Altitude                                      */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_rtc_sync_altitude = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_rtcsync_altitude = create_label(
        row_rtc_sync_altitude,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC Sync Alt",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_rtcsync_altitude = create_label(
        row_rtc_sync_altitude,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_rtcsync_altitude, obj_w_0, obj_height);
    lv_obj_set_size(result.val_rtcsync_altitude, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Title LMST                                                 */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_title_LMST_time = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

