holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_set_size(result.lbl_title_chan1_11, obj_w_0, obj_height);
    lv_obj_set_size(result.lbl_val_chan1_11, obj_w_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Channel1 12                                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row1_12 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    lv_obj_set_flex_flow(row1_12, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row1_12,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    obj_w_0 = (((sub_row_width/2) * 1)) - (sub_column_padding * 1);

    result.lbl_title_chan1_12 = create_label(
        row1_12,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Channel 12",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.lbl_val_chan1_12 = create_label(
        row1_12,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_title_chan1_12, obj_w_0, obj_height);
    lv_obj_set_size(result.lbl_val_chan1_12, obj_w_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Channel1 13                                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row1_13 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    lv_obj_set_flex_flow(row1_13, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row1_13,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    obj_w_0 = (((sub_row_width/2) * 1)) - (sub_column_padding * 1);

    result.lbl_title_chan1_13 = create_label(
        row1_13,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Channel 13",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.lbl_val_chan1_13 = create_label(
        row1_13,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_title_chan1_13, obj_w_0, obj_height);
    lv_obj_set_size(result.lbl_val_chan1_13, obj_w_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Channel1 14                                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row1_14 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    lv_obj_set_flex_flow(row1_14, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row1_14,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    obj_w_0 = (((sub_row_width/2) * 1)) - (sub_column_padding * 1);

    result.lbl_title_chan1_14 = create_label(
        row1_14,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Channel 14",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.lbl_val_chan1_14 = create_label(
        row1_14,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_title_chan1_14, obj_w_0, obj_height);
    lv_obj_set_size(result.lbl_val_chan1_14, obj_w_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Channel1 15                                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row1_15 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    lv_obj_set_flex_flow(row1_15, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row1_15,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    obj_w_0 = (((sub_row_width/2) * 1)) - (sub_column_padding * 1);

    result.lbl_title_chan1_15 = create_label(
        row1_15,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Channel 15",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.lbl_val_chan1_15 = create_label(
        row1_15,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_title_chan1_15, obj_w_0, obj_height);
    lv_obj_set_size(result.lbl_val_chan1_15, obj_w_0, obj_height);

    return result;
}

