holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Label Output ADMplex 0
    result.lbl_output_admplex_0 = create_label(
        row_output_admplex_0,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "OUTPUT ADMplex 0",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    // Switch Output ADMplex 0
    result.sw_output_admplex_0 = create_switch(
        row_output_admplex_0,
        obj_w_1,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0
    );
    lv_obj_add_event_cb(result.sw_output_admplex_0, sw_output_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    lv_obj_set_size(result.lbl_output_admplex_0, obj_w_0, obj_height);
    lv_obj_set_size(result.sw_output_admplex_0, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Output ADMplex 1                                           */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_output_admplex_1 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Adjust Flex
    lv_obj_set_flex_flow(row_output_all, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row_output_all,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    // Label Output ADMplex 1
    result.lbl_output_admplex_1 = create_label(
        row_output_admplex_1,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "OUTPUT ADMplex 1",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    // Switch Output ADMplex 1
    result.sw_output_admplex_1 = create_switch(
        row_output_admplex_1,
        obj_w_1,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0
    );
    lv_obj_add_event_cb(result.sw_output_admplex_1, sw_output_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    lv_obj_set_size(result.lbl_output_admplex_1, obj_w_0, obj_height);
    lv_obj_set_size(result.sw_output_admplex_1, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Title Universe                                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_title_output_uni = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Adjust Flex
    lv_obj_set_flex_flow(row_title_output_uni, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row_title_output_uni,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    // Label
    result.lbl_title_output_uni = create_label(
        row_title_output_uni,
        title_width,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "UNIVERSE",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_title_hue,
        default_title_hue
    );

    lv_obj_set_size(result.lbl_title_output_uni, title_width, obj_height);

    /* ---------------------------------------------------------- */
    /* Output SUN                                                 */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_output_sun = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Adjust Flex
    lv_obj_set_flex_flow(row_output_all, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row_output_all,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    // Label Output SUN
    result.lbl_output_sun = create_label(
        row_output_sun,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "OUTPUT SUN",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    // Switch Output SUN
    result.sw_output_sun = create_switch(
        row_output_sun,
        obj_w_1,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0
    );
    lv_obj_add_event_cb(result.sw_output_sun, sw_output_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    lv_obj_set_size(result.lbl_output_sun, obj_w_0, obj_height);
    lv_obj_set_size(result.sw_output_sun, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Output MERCURY                                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_output_mercury = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Adjust Flex
    lv_obj_set_flex_flow(row_output_all, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row_output_all,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    // Label Output MERCURY
    result.lbl_output_mercury = create_label(
        row_output_mercury,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "OUTPUT MERCURY",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    // Switch Output MERCURY
    result.sw_output_mercury = create_switch(
        row_output_mercury,
        obj_w_1,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0
    );
    lv_obj_add_event_cb(result.sw_output_mercury, sw_output_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    lv_obj_set_size(result.lbl_output_mercury, obj_w_0, obj_height);
    lv_obj_set_size(result.sw_output_mercury, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Output VENUS                                               */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_output_venus = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Adjust Flex
    lv_obj_set_flex_flow(row_output_all, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row_output_all,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    // Label Output VENUS
    result.lbl_output_venus = create_label(
        row_output_venus,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "OUTPUT VENUS",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

