holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Outline
    lv_obj_set_style_outline_width(result.panel, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.panel, default_outline_hue, LV_PART_MAIN);
    lv_obj_set_style_outline_pad(result.panel, outline_padding, LV_PART_MAIN);
    
    // Border
    lv_obj_set_style_border_width(result.panel, 0, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.panel, default_border_hue, LV_PART_MAIN);

    // Background
    lv_obj_set_style_bg_color(result.panel, default_bg_hue, LV_PART_MAIN);

    // Flex
    lv_obj_set_flex_flow(result.panel, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(result.panel, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_START);

    // Row sizes
    int32_t sub_row_width = width_px - (outer_pad_all*2);
    int32_t sub_row_height = row_height-(outline_padding*2);

    // Row Object sizes
    int32_t obj_w_0 = 0;
    int32_t obj_w_1 = 0;
    int32_t obj_w_2 = 0;
    int32_t obj_w_3 = 0;
    int32_t obj_w_4 = 0;
    int32_t obj_w_5 = 0;
    int32_t obj_height = sub_row_height-(outline_width*2)-(sub_row_padding*2);

    /* --- Row Index ------------------------------------------------------- */

    lv_obj_t * row_index = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 100;
    obj_w_1 = (sub_row_width/2) - obj_w_0 - (sub_column_padding*2);

    // Switch Label
    result.label_switch_index_select = create_label(
        row_index,          // parent
        obj_w_0,            // width
        obj_height,         // height
        LV_ALIGN_CENTER,    // parent alignment
        0,                  // pos x
        0,                  // pos y
        "Switch",           // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,   // font
        false,              // transparent background
        false,              // show scrollbar
        false,              // enable scrolling
        2,                  // outline width
        general_radius,     // outline radius
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    // Switch Value
    result.dd_switch_index_select = create_dropdown_menu(
        row_index,
        NULL,
        0,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_switch_index_select_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < 45; i++) {
        // vTaskDelay(pdMS_TO_TICKS(5));
        snprintf(dd_switch_index_select_name, sizeof(dd_switch_index_select_name), "%d", i);
        lv_dropdown_add_option(result.dd_switch_index_select, dd_switch_index_select_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_switch_index_select, 0);
    lv_obj_add_event_cb(result.dd_switch_index_select, dd_switch_index_select_event_cb, LV_EVENT_VALUE_CHANGED, NULL);
    
    // Function Label
    result.label_function_index_select = create_label(
        row_index,            // parent
        obj_w_0,              // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Function",           // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_subtitle_hue
    );
    
    // Function Value
    result.dd_function_index_select = create_dropdown_menu(
        row_index,
        NULL,
        0,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_function_index_select_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_SWITCH_FUNCTIONS; i++) {
        // vTaskDelay(pdMS_TO_TICKS(5));
        snprintf(dd_function_index_select_name, sizeof(dd_function_index_select_name), "%d", i);
        lv_dropdown_add_option(result.dd_function_index_select, dd_function_index_select_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_function_index_select, 0);
    lv_obj_add_event_cb(result.dd_function_index_select, dd_function_index_select_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Critical for alignment
    lv_obj_set_size(result.label_switch_index_select, obj_w_0, obj_height);
    lv_obj_set_size(result.dd_switch_index_select, obj_w_1, obj_height);
    lv_obj_set_size(result.label_function_index_select, obj_w_0, obj_height);
    lv_obj_set_size(result.dd_function_index_select, obj_w_1, obj_height);
    
    /* --- Function Name ------------------------------------------------------- */
    
    lv_obj_t * row_input_value = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 100;
    obj_w_1 = (sub_row_width) - obj_w_0 - (sub_column_padding*2);
    
    // Label Function Name
    result.label_function_name = create_label(
        row_input_value,      // parent
        obj_w_0,              // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Input",              // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_subtitle_hue
    );
    
    // Value Function Name
    result.dd_function_name = create_dropdown_menu(
        row_input_value,
        NULL,
        0,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_function_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_FUNCTION_NAMES; i++) {
        // vTaskDelay(pdMS_TO_TICKS(5));
        snprintf(dd_function_name, sizeof(dd_function_name), "%s", matrixData.matrix_function_names[i]);
        lv_dropdown_add_option(result.dd_function_name, dd_function_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_function_name, 0);
    lv_obj_add_event_cb(result.dd_function_name, dd_function_name_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Critical for alignment
    lv_obj_set_size(result.label_function_name, obj_w_0, obj_height);
    lv_obj_set_size(result.dd_function_name, obj_w_1, obj_height);
    
