holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    result.roll_panel = lv_obj_create(result.panel);

    // Hide & disable scrollbar
    lv_obj_set_scrollbar_mode(result.roll_panel, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_scroll_dir(result.roll_panel, LV_DIR_NONE);

    // Size and position
    lv_obj_set_size(result.roll_panel, roll_size_w, roll_size_h);
    lv_obj_align(result.roll_panel, alignment, pos_x, pos_y);

    // Main style: radius
    lv_obj_set_style_radius(result.roll_panel, 0, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.roll_panel, 0, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.roll_panel, default_outline_hue, LV_PART_MAIN);
    
    // Main style: border
    lv_obj_set_style_border_width(result.roll_panel, 0, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.roll_panel, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_opa(result.roll_panel, LV_OPA_0, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.roll_panel, 0, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.roll_panel, default_shadow_hue, LV_PART_MAIN);

    // Remove padding
    lv_obj_set_style_pad_all(result.roll_panel, 2, LV_PART_MAIN);

    // Set pivot
    lv_obj_set_style_transform_pivot_x(result.roll_panel, lv_pct(50), LV_PART_MAIN);
    lv_obj_set_style_transform_pivot_y(result.roll_panel, lv_pct(50), LV_PART_MAIN);

    // wing line
    lv_color_t roll_line_color = lv_color_make(0, 255, 0);
    int32_t roll_line_width = 2;

    // wing line lower
    int32_t wing_line_lower_length = (roll_size_w / 100)*33;

    // wing line side
    int32_t wing_line_side_length = roll_size_h-(roll_line_width);

    // Left roll line
    {
        static lv_point_precise_t left_wing_line_lower_pts[2];
        left_wing_line_lower_pts[0].x = 0;
        left_wing_line_lower_pts[0].y = 0;
        left_wing_line_lower_pts[1].x = wing_line_lower_length;
        left_wing_line_lower_pts[1].y = 0;
        lv_obj_t *left_wing_line_lower = lv_line_create(result.roll_panel);
        lv_line_set_points(left_wing_line_lower, left_wing_line_lower_pts, 2);
        lv_obj_set_style_line_width(left_wing_line_lower, roll_line_width, LV_PART_MAIN);
        lv_obj_set_style_line_color(left_wing_line_lower, roll_line_color, LV_PART_MAIN);
        lv_obj_align(left_wing_line_lower, LV_ALIGN_BOTTOM_LEFT, 0, 0);

        static lv_point_precise_t wing_line_side_left_pts[2];
        wing_line_side_left_pts[0].x = 0;
        wing_line_side_left_pts[0].y = 0;
        wing_line_side_left_pts[1].x = 0;
        wing_line_side_left_pts[1].y = wing_line_side_length;
        lv_obj_t *wing_line_side_left = lv_line_create(result.roll_panel);
        lv_line_set_points(wing_line_side_left, wing_line_side_left_pts, 2);
        lv_obj_set_style_line_width(wing_line_side_left, roll_line_width, LV_PART_MAIN);
        lv_obj_set_style_line_color(wing_line_side_left, roll_line_color, LV_PART_MAIN);
        lv_obj_align(wing_line_side_left, LV_ALIGN_LEFT_MID, 0, 0);
    }

    // Right roll line
    {
        static lv_point_precise_t right_wing_line_lower_pts[2];
        right_wing_line_lower_pts[0].x = 0;
        right_wing_line_lower_pts[0].y = 0;
        right_wing_line_lower_pts[1].x = wing_line_lower_length;
        right_wing_line_lower_pts[1].y = 0;
        lv_obj_t *right_wing_line_lower = lv_line_create(result.roll_panel);
        lv_line_set_points(right_wing_line_lower, right_wing_line_lower_pts, 2);
        lv_obj_set_style_line_width(right_wing_line_lower, roll_line_width, LV_PART_MAIN);
        lv_obj_set_style_line_color(right_wing_line_lower, roll_line_color, LV_PART_MAIN);
        lv_obj_align(right_wing_line_lower, LV_ALIGN_BOTTOM_RIGHT, 0, 0);

        static lv_point_precise_t wing_line_side_right_pts[2];
        wing_line_side_right_pts[0].x = 0;
        wing_line_side_right_pts[0].y = 0;
        wing_line_side_right_pts[1].x = 0;
        wing_line_side_right_pts[1].y = wing_line_side_length;
        lv_obj_t *wing_line_side_right = lv_line_create(result.roll_panel);
        lv_line_set_points(wing_line_side_right, wing_line_side_right_pts, 2);
        lv_obj_set_style_line_width(wing_line_side_right, roll_line_width, LV_PART_MAIN);
        lv_obj_set_style_line_color(wing_line_side_right, roll_line_color, LV_PART_MAIN);
        lv_obj_align(wing_line_side_right, LV_ALIGN_RIGHT_MID, 0, 0);
    }

    // Center rectangle
    {
        int32_t rect_width = roll_size_h-10;
        int32_t rect_height = roll_size_h-10;
        lv_obj_t *center_rect = lv_obj_create(result.roll_panel);

        // Hide & disable scrollbar
        lv_obj_set_scrollbar_mode(center_rect, LV_SCROLLBAR_MODE_OFF);
        lv_obj_set_scroll_dir(center_rect, LV_DIR_NONE);

        // Size and position
        lv_obj_set_size(center_rect, rect_width, rect_height);
        lv_obj_align(center_rect, LV_ALIGN_CENTER, 0, 0);

        // Main style: radius
        lv_obj_set_style_radius(center_rect, 0, LV_PART_MAIN);

        // Main style: outline
        lv_obj_set_style_outline_width(center_rect, 2, LV_PART_MAIN);
        lv_obj_set_style_outline_color(center_rect, lv_color_make(0, 255, 0), LV_PART_MAIN);
        
        // Main style: border
        lv_obj_set_style_border_width(center_rect, 0, LV_PART_MAIN);
        lv_obj_set_style_border_color(center_rect, default_border_hue, LV_PART_MAIN);

        // Main style: background
        lv_obj_set_style_bg_opa(center_rect, LV_OPA_0, LV_PART_MAIN);

        // Main style: shadow
        lv_obj_set_style_shadow_width(center_rect, 0, LV_PART_MAIN);
        lv_obj_set_style_shadow_color(center_rect, default_shadow_hue, LV_PART_MAIN);

        // Remove padding
        lv_obj_set_style_pad_all(center_rect, 0, LV_PART_MAIN);
    }

    // #############################################################################################
    // PITCH INDICATOR  (vertical strip — left of roll symbol)
    // pitch_panel       = sliding indicator  (moved per-frame with lv_obj_set_y)
    // pitch_panel_height_px = track height   (determines max pixel travel at ±90°)
    // pitch_panel_width_px  = indicator base y at 0° pitch (stored for update_display)
    // #############################################################################################

    {
        const int32_t pt_track_w = 4;
        const int32_t pt_track_h = (size_h_px * 4) / 5;               // 400 px
        const int32_t pt_track_x = 20;
        const int32_t pt_track_y = (size_h_px - pt_track_h) / 2;      // 50 px
        const int32_t pt_indic_w = 14;
        const int32_t pt_indic_h = pt_track_w;

