holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
        result.pitch_panel_height_px = pt_track_h;   // pixel range for [-90, +90]
        result.pitch_panel_width_px  = pt_track_y;   // track top y (absolute)

        // Track (static, not stored)
        lv_obj_t *pt = lv_obj_create(result.panel);
        lv_obj_set_scrollbar_mode(pt, LV_SCROLLBAR_MODE_OFF);
        lv_obj_set_scroll_dir(pt, LV_DIR_NONE);
        lv_obj_set_size(pt, pt_track_w, pt_track_h);
        lv_obj_set_pos(pt, pt_track_x, pt_track_y);
        lv_obj_set_style_radius(pt, 0, LV_PART_MAIN);
        lv_obj_set_style_outline_width(pt, 0, LV_PART_MAIN);
        lv_obj_set_style_border_width(pt, 1, LV_PART_MAIN);
        lv_obj_set_style_border_color(pt, lv_color_make(0, 255, 0), LV_PART_MAIN);
        lv_obj_set_style_bg_opa(pt, LV_OPA_0, LV_PART_MAIN);
        lv_obj_set_style_shadow_width(pt, 0, LV_PART_MAIN);
        lv_obj_set_style_pad_all(pt, 0, LV_PART_MAIN);

        // Sliding indicator
        result.pitch_panel = lv_obj_create(result.panel);
        lv_obj_set_scrollbar_mode(result.pitch_panel, LV_SCROLLBAR_MODE_OFF);
        lv_obj_set_scroll_dir(result.pitch_panel, LV_DIR_NONE);
        lv_obj_set_size(result.pitch_panel, pt_indic_w, pt_indic_h);
        lv_obj_set_pos(result.pitch_panel,
            pt_track_x + (pt_track_w / 2) - (pt_indic_w / 2),
            result.pitch_panel_width_px);
        lv_obj_set_style_radius(result.pitch_panel, 0, LV_PART_MAIN);
        lv_obj_set_style_outline_width(result.pitch_panel, 0, LV_PART_MAIN);
        lv_obj_set_style_border_width(result.pitch_panel, 0, LV_PART_MAIN);
        lv_obj_set_style_bg_color(result.pitch_panel, lv_color_make(0, 255, 0), LV_PART_MAIN);
        lv_obj_set_style_bg_opa(result.pitch_panel, LV_OPA_COVER, LV_PART_MAIN);
        lv_obj_set_style_shadow_width(result.pitch_panel, 0, LV_PART_MAIN);
        lv_obj_set_style_pad_all(result.pitch_panel, 0, LV_PART_MAIN);
    }

    // #############################################################################################
    // YAW INDICATOR  (horizontal strip — above roll symbol)
    // yaw_panel       = sliding indicator  (moved per-frame with lv_obj_set_x)
    // yaw_panel_width_px  = track width    (determines full 360° travel in px)
    // yaw_panel_height_px = track left x   (indicator x at 0° yaw — stored for update_display)
    // #############################################################################################

    {
        const int32_t yw_track_h = 4;
        const int32_t yw_track_w = (size_w_px * 4) / 5;
        const int32_t yw_track_y = 20;
        const int32_t yw_track_x = (size_w_px - yw_track_w) / 2;
        const int32_t yw_indic_h = 14;
        const int32_t yw_indic_w = yw_track_h;

        result.yaw_panel_width_px  = yw_track_w;
        result.yaw_panel_height_px = yw_track_x;  // base x (indicator x at 0°)

        // Track (static, not stored)
        lv_obj_t *yt = lv_obj_create(result.panel);
        lv_obj_set_scrollbar_mode(yt, LV_SCROLLBAR_MODE_OFF);
        lv_obj_set_scroll_dir(yt, LV_DIR_NONE);
        lv_obj_set_size(yt, yw_track_w, yw_track_h);
        lv_obj_set_pos(yt, yw_track_x, yw_track_y);
        lv_obj_set_style_radius(yt, 0, LV_PART_MAIN);
        lv_obj_set_style_outline_width(yt, 0, LV_PART_MAIN);
        lv_obj_set_style_border_width(yt, 1, LV_PART_MAIN);
        lv_obj_set_style_border_color(yt, lv_color_make(0, 255, 0), LV_PART_MAIN);
        lv_obj_set_style_bg_opa(yt, LV_OPA_0, LV_PART_MAIN);
        lv_obj_set_style_shadow_width(yt, 0, LV_PART_MAIN);
        lv_obj_set_style_pad_all(yt, 0, LV_PART_MAIN);

        // Sliding indicator
        result.yaw_panel = lv_obj_create(result.panel);
        lv_obj_set_scrollbar_mode(result.yaw_panel, LV_SCROLLBAR_MODE_OFF);
        lv_obj_set_scroll_dir(result.yaw_panel, LV_DIR_NONE);
        lv_obj_set_size(result.yaw_panel, yw_indic_w, yw_indic_h);
        lv_obj_set_pos(result.yaw_panel,
            result.yaw_panel_height_px,
            yw_track_y + (yw_track_h / 2) - (yw_indic_h / 2));
        lv_obj_set_style_radius(result.yaw_panel, 0, LV_PART_MAIN);
        lv_obj_set_style_outline_width(result.yaw_panel, 0, LV_PART_MAIN);
        lv_obj_set_style_border_width(result.yaw_panel, 0, LV_PART_MAIN);
        lv_obj_set_style_bg_color(result.yaw_panel, lv_color_make(0, 255, 0), LV_PART_MAIN);
        lv_obj_set_style_bg_opa(result.yaw_panel, LV_OPA_COVER, LV_PART_MAIN);
        lv_obj_set_style_shadow_width(result.yaw_panel, 0, LV_PART_MAIN);
        lv_obj_set_style_pad_all(result.yaw_panel, 0, LV_PART_MAIN);
    }

    // #############################################################################################
    // COORD
    // #############################################################################################

    result.gyro_angle_x_label = create_label(
        result.panel,         // parent
        100,                  // width
        20,                   // height
        LV_ALIGN_TOP_LEFT,  // parent alignment
        50,                    // pos x
        50,                  // pos y
        "ROL ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    result.gyro_angle_y_label = create_label(
        result.panel,         // parent
        100,                  // width
        20,                   // height
        LV_ALIGN_TOP_LEFT,  // parent alignment
        50,                    // pos x
        70,                  // pos y
        "PIT ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    ); 
    
    result.gyro_angle_z_label = create_label(
        result.panel,         // parent
        100,                  // width
        20,                   // height
        LV_ALIGN_TOP_LEFT,  // parent alignment
        50,                    // pos x
        90,                  // pos y
        "YAW ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    ); 

    result.gyro_gforce_x_label = create_label(
        result.panel,         // parent
        100,                  // width
        20,                   // height
        LV_ALIGN_TOP_LEFT,  // parent alignment
        150,                    // pos x
        50,                  // pos y
        "GROL ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    result.gyro_gforce_y_label = create_label(
        result.panel,         // parent
        100,                  // width
        20,                   // height
        LV_ALIGN_TOP_LEFT,  // parent alignment
        150,                    // pos x
        70,                  // pos y
        "GPIT ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    ); 
    
    result.gyro_gforce_z_label = create_label(
        result.panel,         // parent
        100,                  // width
        20,                   // height
        LV_ALIGN_TOP_LEFT,  // parent alignment
        150,                    // pos x
        90,                  // pos y
        "GYAW ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    ); 

    result.latitude_label = create_label(
        result.panel,         // parent
        200,                  // width
        20,                   // height
        LV_ALIGN_BOTTOM_LEFT, // parent alignment
        0,                    // pos x
        -20,                  // pos y
        "LAT ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    result.longitude_label = create_label(
        result.panel,         // parent
        200,                  // width
        20,                   // height
        LV_ALIGN_BOTTOM_LEFT, // parent alignment
        0,                    // pos x
        0,                    // pos y
        "LON ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    result.speed_label = create_label(
        result.panel,         // parent
        200,                  // width
        20,                   // height
        LV_ALIGN_BOTTOM_MID,  // parent alignment
        0,                    // pos x
        0,                  // pos y
        "SPE ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

