holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                // ────────────────────────────────────────────────
                // Local Year Day
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_local_yday, String(satioData.localTime.yday).c_str());

                // ────────────────────────────────────────────────
                // Local Weekday Name
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_local_wday_name, String(satioData.localTime.wday_name).c_str());

                // ────────────────────────────────────────────────
                // Local Month Name
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_local_month_name, String(satioData.localTime.month_name).c_str());


                // ────────────────────────────────────────────────
                // Formatted Local Time
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_formatted_local_time, String(satioData.localTime.formatted_time_HHMMSS).c_str());

                // ────────────────────────────────────────────────
                // Formatted Local Date
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_formatted_local_date, String(satioData.localTime.formatted_date_DDMMYYYY).c_str());

                // ────────────────────────────────────────────────
                // Local Unix Time (μs)
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_local_unixtime_us, String(satioData.localTime.unixtime_uS).c_str());

                // ────────────────────────────────────────────────
                // Formatted System Time Sync Time (last GPS/manual sync)
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_formatted_rtc_sync_time, String(satioData.systemTime.sync_formatted_time_HHMMSS).c_str());

                // ────────────────────────────────────────────────
                // Formatted System Time Sync Date (last GPS/manual sync)
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_formatted_rtc_sync_date, String(satioData.systemTime.sync_formatted_date_DDMMYYYY).c_str());

                // ────────────────────────────────────────────────
                // Sync Latitude (this board has no RTC-chip position snapshot;
                // shows the current system latitude/longitude/altitude instead)
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_rtcsync_latitude, String(satioData.system_degrees_latitude, 7).c_str());

                // ────────────────────────────────────────────────
                // Sync Longitude
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_rtcsync_longitude, String(satioData.system_degrees_longitude, 7).c_str());

                // ────────────────────────────────────────────────
                // Sync Altitude
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_rtcsync_altitude, String(gnggaData.altitude).c_str());

                // ────────────────────────────────────────────────
                // Formatted System Time
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_formatted_rtc_time, String(satioData.systemTime.formatted_time_HHMMSS).c_str());

                // ────────────────────────────────────────────────
                // Formatted System Date
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_formatted_rtc_date, String(satioData.systemTime.formatted_date_DDMMYYYY).c_str());

                // ────────────────────────────────────────────────
                // System Time Unix Time (s)
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_rtc_unixtime, String((uint32_t)(satioData.systemTime.unixtime_uS / 1000000ULL)).c_str());


                // ────────────────────────────────────────────────
                // UTC Second Offset
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_utc_second_offset, String(satioData.systemTime.second_offset).c_str());

                // ────────────────────────────────────────────────
                // UTC Auto Offset Flag
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_utc_auto_offset_flag, satioData.systemTime.auto_offset_flag ? "Yes" : "No");

                // ────────────────────────────────────────────────
                // Set Time Automatically
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_set_time_automatically, satioData.systemTime.set_time_automatically ? "Yes" : "No");

                // ────────────────────────────────────────────────
                // GPS Altitude
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_altitude, String(satioData.altitude).c_str());

                // ────────────────────────────────────────────────
                // User Altitude
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_user_altitude, String(satioData.user_altitude, 7).c_str());

                // ────────────────────────────────────────────────
                // System Altitude
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_sys_altitude, String(satioData.system_altitude, 7).c_str());

