holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                // ────────────────────────────────────────────────
                // LMST Sunset
                // ────────────────────────────────────────────────
                lv_label_set_text(
                    satio_c.val_LMST_sunset,
                    String(
                        String(satioData.localMeanSolarTime.photo_period_schedule.dusk_start[SunriseSunset]) +
                        String(" - ") +
                        String(satioData.localMeanSolarTime.photo_period_schedule.dusk_end[SunriseSunset])
                    ).c_str()
                );

                // ────────────────────────────────────────────────
                // LMST Civil Twilight Dusk
                // ────────────────────────────────────────────────
                lv_label_set_text(
                    satio_c.val_LMST_civil_twilight_dusk,
                    String(
                        String(satioData.localMeanSolarTime.photo_period_schedule.dusk_start[CivilTwilight]) +
                        String(" - ") +
                        String(satioData.localMeanSolarTime.photo_period_schedule.dusk_end[CivilTwilight])
                    ).c_str()
                );

                // ────────────────────────────────────────────────
                // LMST Nautical Twilight Dusk
                // ────────────────────────────────────────────────
                lv_label_set_text(
                    satio_c.val_LMST_nautical_twilight_dusk,
                    String(
                        String(satioData.localMeanSolarTime.photo_period_schedule.dusk_start[NauticalTwilight]) +
                        String(" - ") +
                        String(satioData.localMeanSolarTime.photo_period_schedule.dusk_end[NauticalTwilight])
                    ).c_str()
                );

                // ────────────────────────────────────────────────
                // LMST Astronomical Twilight Dusk
                // ────────────────────────────────────────────────
                lv_label_set_text(
                    satio_c.val_LMST_astronomical_twilight_dusk,
                    String(
                        String(satioData.localMeanSolarTime.photo_period_schedule.dusk_start[AstronomicalTwilight]) +
                        String(" - ") +
                        String(satioData.localMeanSolarTime.photo_period_schedule.dusk_end[AstronomicalTwilight])
                    ).c_str()
                );

                // ────────────────────────────────────────────────
                // LMST Astronomical Night
                // ────────────────────────────────────────────────
                lv_label_set_text(
                    satio_c.val_LMST_astronomical_night,
                    String(
                        String(satioData.localMeanSolarTime.photo_period_schedule.dusk_start[AstronomicalNight]) +
                        String(" - ") +
                        String(satioData.localMeanSolarTime.photo_period_schedule.dawn_end[AstronomicalNight])
                    ).c_str()
                );
            }
        }

        else if (current_gps_panel==1) {
            if (gngga_c.panel) {
                // Hide
                lv_obj_add_flag(gnrmc_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(gpatt_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(satio_c.panel, LV_OBJ_FLAG_HIDDEN);
                // Show
                lv_obj_remove_flag(gngga_c.panel, LV_OBJ_FLAG_HIDDEN);

                // Switch Panel
                lv_obj_set_style_text_color(gps_switch_panel.switch_satio_panel.label, default_btn_off_value_hue, LV_PART_MAIN);
                lv_obj_set_style_bg_color(gps_switch_panel.switch_satio_panel.panel, default_btn_off_bg, LV_PART_MAIN);

                lv_obj_set_style_text_color(gps_switch_panel.switch_gngga_panel.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                lv_obj_set_style_bg_color(gps_switch_panel.switch_gngga_panel.panel, default_btn_on_bg, LV_PART_MAIN);

                lv_obj_set_style_text_color(gps_switch_panel.switch_gnrmc_panel.label, default_btn_off_value_hue, LV_PART_MAIN);
                lv_obj_set_style_bg_color(gps_switch_panel.switch_gnrmc_panel.panel, default_btn_off_bg, LV_PART_MAIN);

                lv_obj_set_style_text_color(gps_switch_panel.switch_gpatt_panel.label, default_btn_off_value_hue, LV_PART_MAIN);
                lv_obj_set_style_bg_color(gps_switch_panel.switch_gpatt_panel.panel, default_btn_off_bg, LV_PART_MAIN);

                lv_label_set_text(gngga_c.val_utc_time, String(gnggaData.utc_time).c_str());

                lv_label_set_text(gngga_c.val_latitude, String(String(gnggaData.latitude_hemisphere) + " " + String(gnggaData.latitude)).c_str());

                lv_label_set_text(gngga_c.val_longitude, String(String(gnggaData.longitude_hemisphere) + " " + String(gnggaData.longitude)).c_str());

                lv_label_set_text(gngga_c.val_solution_status, String(gnggaData.solution_status).c_str());

                lv_label_set_text(gngga_c.val_sat_count, String(gnggaData.satellite_count).c_str());

                lv_label_set_text(gngga_c.val_gps_precision_factor, String(gnggaData.gps_precision_factor).c_str());

                lv_label_set_text(gngga_c.val_altitude, String(String(gnggaData.altitude) + " " + String(gnggaData.altitude_units)).c_str());

                lv_label_set_text(gngga_c.val_geoidal, String(String(gnggaData.geoidal) + " " + String(gnggaData.geoidal_units)).c_str());

                lv_label_set_text(gngga_c.val_differential_delay, String(gnggaData.differential_delay).c_str());

                lv_label_set_text(gngga_c.val_bad_element_count, String(gnggaData.total_bad_elements).c_str());
            }
        }

        else if (current_gps_panel==2) {
            if (gnrmc_c.panel) {
                // Hide
                lv_obj_add_flag(gngga_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(gpatt_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(satio_c.panel, LV_OBJ_FLAG_HIDDEN);
                // Show
                lv_obj_remove_flag(gnrmc_c.panel, LV_OBJ_FLAG_HIDDEN);

                // Switch Panel
                lv_obj_set_style_text_color(gps_switch_panel.switch_satio_panel.label, default_btn_off_value_hue, LV_PART_MAIN);
                lv_obj_set_style_bg_color(gps_switch_panel.switch_satio_panel.panel, default_btn_off_bg, LV_PART_MAIN);

                lv_obj_set_style_text_color(gps_switch_panel.switch_gngga_panel.label, default_btn_off_value_hue, LV_PART_MAIN);
                lv_obj_set_style_bg_color(gps_switch_panel.switch_gngga_panel.panel, default_btn_off_bg, LV_PART_MAIN);

