holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
            // ────────────────────────────────────────────────
            // Acceleration
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_acc_x, String(gyroData.gyro_0_acc_x).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_acc_y, String(gyroData.gyro_0_acc_y).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_acc_z, String(gyroData.gyro_0_acc_z).c_str());

            // ────────────────────────────────────────────────
            // Gyroscope 
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_gyr_x, String(gyroData.gyro_0_gyr_x).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_gyr_y, String(gyroData.gyro_0_gyr_y).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_gyr_z, String(gyroData.gyro_0_gyr_z).c_str());

            // ────────────────────────────────────────────────
            // Magnetometer 
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_mag_x, String(gyroData.gyro_0_mag_x).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_mag_y, String(gyroData.gyro_0_mag_y).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_mag_z, String(gyroData.gyro_0_mag_z).c_str());

            // ────────────────────────────────────────────────
            // Current UI Baud Rate
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_current_uiBaud, String(gyroData.gyro_0_current_uiBaud).c_str());
        }
    }

    // ---------------------
    // MPlex screen
    // ---------------------
    else if (current_screen_number == MPLEX0_SCREEN) {
        if (admlpex0_c.panel) {
            lv_label_set_text(admlpex0_c.lbl_val_chan_0,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_0]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_1,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_1]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_2,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_2]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_3,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_3]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_4,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_4]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_5,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_5]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_6,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_6]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_7,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_7]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_8,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_8]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_9,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_9]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_10, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_10]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_11, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_11]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_12, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_12]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_13, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_13]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_14, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_14]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_15, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_15]).c_str());

            lv_label_set_text(admlpex0_c.lbl_val_chan1_0,  String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_0]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan1_1,  String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_1]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan1_2,  String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_2]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan1_3,  String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_3]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan1_4,  String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_4]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan1_5,  String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_5]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan1_6,  String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_6]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan1_7,  String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_7]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan1_8,  String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_8]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan1_9,  String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_9]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan1_10, String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_10]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan1_11, String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_11]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan1_12, String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_12]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan1_13, String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_13]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan1_14, String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_14]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan1_15, String(ad_mux_1.data[INDEX_ADMPLEX_1_CH_15]).c_str());
        }
    }

    // ---------------------
    // UAP screen
    // ---------------------
    else if (current_screen_number == UAP_SCREEN) {
        
        // ────────────────────────────────────────────────
        // Roll
        // ────────────────────────────────────────────────
        if (uap_c.roll_panel) {
            lv_obj_set_style_transform_rotation(uap_c.roll_panel, (int32_t)gyroData.gyro_0_ang_x*10, LV_PART_MAIN);
        }

        // ────────────────────────────────────────────────
        // Pitch
        // ────────────────────────────────────────────────
        if (uap_c.pitch_panel) {
            // map [-90, +90] → [track_bottom, track_top]  (+pitch = up = smaller y)
            float t_pitch = ((float)gyroData.gyro_0_ang_y + 90.0f) / 180.0f;
            lv_obj_set_y(uap_c.pitch_panel,
                uap_c.pitch_panel_width_px + (int32_t)((1.0f - t_pitch) * (float)uap_c.pitch_panel_height_px));
        }

